## pandas loc method
access a group of rows and columns by label(s) or a boolean array

In [1]:
import pandas as pd

In [2]:
data =pd.read_csv('C:\\Users\\admin\\Desktop\\book1.csv')
data

   Age      Dates  Genders   Date  marks
0   34   9/7/2012      5.0    7.0     10
1   56  12/4/2018      NaN   22.0     20
2   23   30/04/22      NaN    NaN     30
3   45   1/9/2022      2.0  556.0     40
4   34   9/7/2012      5.0    7.0     10
5   56  12/4/2018      7.0   22.0     20
6   23   30/04/22      5.0    NaN     30
7   45   1/9/2022      2.0  556.0     40

In [4]:
data.loc[0]

Age              34
Dates      9/7/2012
Genders         5.0
Date            7.0
marks            10
Name: 0, dtype: object

In [6]:
data.loc[3]

Age              45
Dates      1/9/2022
Genders         2.0
Date          556.0
marks            40
Name: 3, dtype: object

In [7]:
data.loc[[1,3]]

   Age      Dates  Genders   Date  marks
1   56  12/4/2018      NaN   22.0     20
3   45   1/9/2022      2.0  556.0     40

In [8]:
data.loc[[4,3]]

   Age     Dates  Genders   Date  marks
4   34  9/7/2012      5.0    7.0     10
3   45  1/9/2022      2.0  556.0     40

In [10]:
data.loc[1,"Date"]

22.0

In [12]:
data.loc[1:5,"marks"]

1    20
2    30
3    40
4    10
5    20
Name: marks, dtype: int64

# pandas iloc method

### select data by indexing

In [15]:
data.iloc[[0]]

   Age     Dates  Genders  Date  marks
0   34  9/7/2012      5.0   7.0     10

In [16]:
data.iloc[0]

Age              34
Dates      9/7/2012
Genders         5.0
Date            7.0
marks            10
Name: 0, dtype: object

In [17]:
data.iloc[[0,1]]

   Age      Dates  Genders  Date  marks
0   34   9/7/2012      5.0   7.0     10
1   56  12/4/2018      NaN  22.0     20